{
  "characters": [
    {
      "id": 1,
      "name": "Luke Skywalker",
      "origin": "Tattooine",
      "role": "Jedi Knight",
      "portrait": "https://i.imgur.com/fWFfKh2.jpg",
      "image": "https://i.imgur.com/8EAC0YI.png",
      "family": [
        {
          "name": "Padme Amidala",
          "member": "Mother"
        },
        {
          "name": "Anakin Skywalker",
          "member": "Father"
        },
        {
          "name": "Leia Organa",
          "member": "Sister"
        }
      ],
      "description": "Luke Skywalker, a Force-sensitive human male, was a legendary Jedi Master who fought in the Galactic Civil War during the reign of the Galactic Empire. Along with his companions, Princess Leia Organa and General Han Solo, Skywalker served as a revolutionary on the side of the Alliance to Restore the Republic—an organization committed to the downfall of the Galactic Empire and the restoration of democracy. Following the war, Skywalker became a living legend, and was remembered as one of the greatest Jedi in galactic history."
    },
    {
      "id": 2,
      "name": "Leia Organa",
      "origin": "Alderaan",
      "role": "General / Princess",
      "portrait": "https://i.imgur.com/TaG7GYv.jpg",
      "image": "https://i.imgur.com/ljyNiEF.png",
      "family": [
        {
          "name": "Padme Amidala",
          "member": "Mother"
        },
        {
          "name": "Anakin Skywalker",
          "member": "Father"
        },
        {
          "name": "Luke Skywalker",
          "member": "Brother"
        },
        {
          "name": "Han Solo",
          "member": "Husband"
        },
        {
          "name": "Ben Solo",
          "member": "Son"
        }
      ],
      "description": "Leia Skywalker Organa Solo was a Force-sensitive human female political and military leader who served in the Alliance to Restore the Republic during the Imperial Era and the New Republic and Resistance in the subsequent New Republic Era. Adopted into the House of Organa, the Alderaanian royal family, she was Princess Leia Organa of Alderaan, a planet in the Core Worlds known for its dedication to pacifism. The princess was raised as the daughter of Senator Bail Prestor Organa and his wife, Queen Breha Organa, making her the heir to the Alderaanian monarchy. Instilled with the values of her adopted homeworld, Organa devoted her life to the restoration of democracy by opposing authoritarian regimes such as the Galactic Empire and the First Order."
    },
    {
      "id": 3,
      "name": "Han Solo",
      "origin": "Corellia",
      "role": "Smuggler / General",
      "portrait": "https://i.imgur.com/vfBb6h8.jpg",
      "image": "https://i.imgur.com/BFsqcOR.png",
      "family": [
        {
          "name": "Leia Organa",
          "member": "Wife"
        },
        {
          "name": "Ben Solo",
          "member": "Son"
        }
      ],
      "description": "Han Solo, known only as Han until being given the surname Solo by an Imperial recruitment officer, and formerly known as Cadet 124-329 while serving as an Imperial cadet, was a human male smuggler. He became a leader in the Alliance to Restore the Republic and an instrumental figure in the defeat of the Galactic Empire during the Galactic Civil War. He hailed from Corellia and became a smuggler, even completing the Kessel Run in just twelve parsecs with his prized ship, the Millennium Falcon, and coming under the employ of Jabba the Hutt. He was the son-in-law of fallen Jedi Knight Anakin Skywalker and Senator Padmé Amidala, husband of Princess Leia Organa, brother-in-law of Jedi Master Luke Skywalker, father of Ben Solo, rivals and close friends with fellow smuggler Lando Calrissian, and best friends with the Wookiee Chewbacca, his trusted copilot who swore a life debt to the Corellian smuggler."
    },
    {
      "id": 4,
      "name": "Anakin Skywalker",
      "origin": "Tattooine",
      "role": "Jedi Knight",
      "portrait": "https://i.imgur.com/JAdIrSE.jpg",
      "image": "https://i.imgur.com/6STOwsk.png",
      "family": [
        {
          "name": "Padme Amidala",
          "member": "Wife"
        },
        {
          "name": "Shmi Skywalker",
          "member": "Mother"
        },
        {
          "name": "Luke Skywalker",
          "member": "Son"
        },
        {
          "name": "Leia Organa",
          "member": "Daughter"
        }
      ],
      "description": "Anakin Skywalker was a legendary Force-sensitive human male who was a Jedi Knight of the Galactic Republic and the prophesied Chosen One of the Jedi Order, destined to bring balance to the Force. Also known as 'Ani' during his childhood, Skywalker earned the moniker 'Hero With No Fear' from his accomplishments in the Clone Wars. His alter ego, Darth Vader, the Dark Lord of the Sith, was created when Skywalker turned to the dark side of the Force, pledging his allegiance to the Sith Lord Darth Sidious at the end of the Republic Era."
    },
    {
      "id": 5,
      "name": "Obi-Wan Kenobi",
      "origin": "Stewjon",
      "role": "Jedi Knight",
      "portrait": "https://i.imgur.com/EB7kpP4.jpg",
      "image": "https://i.imgur.com/BU0nEmH.png",
      "description": "Obi-Wan Kenobi, also known as Ben Kenobi, was a legendary human male Jedi Master who served on the Jedi High Council during the final years of the Republic Era. As a Jedi General, Kenobi served in the Grand Army of the Republic that fought against the Separatist Droid Army during the Clone Wars. Kenobi, however, was forced into exile as a result of the Great Jedi Purge. As a mentor, Kenobi was responsible for training two members of the Skywalker family, Anakin Skywalker and Luke Skywalker, both of whom served in turn as his Padawan in the ways of the Force."
    },
    {
      "id": 6,
      "name": "Ahsoka Tano",
      "origin": "Shili",
      "role": "Jedi",
      "portrait": "https://i.imgur.com/GNf9Hrg.jpg",
      "image": "https://i.imgur.com/hC7njvG.png",
      "description": "Ahsoka Tano was a Force-sensitive Togruta female former Jedi Padawan who, after the Clone Wars, helped establish a network of various rebel cells against the Galactic Empire. Tano was discovered on her homeworld of Shili by Jedi Master Plo Koon, who brought her to the Jedi Temple on Coruscant to receive Jedi training. Following the outbreak of the Clone Wars, Jedi Grand Master Yoda assigned the young Tano to be the Padawan learner of Jedi Knight Anakin Skywalker, who nicknamed her 'Snips' when she joined him at the Battle of Christophsis. Whereas Tano was eager to prove herself, Skywalker had a reputation for recklessness, and they had a rather difficult start as master and apprentice. Yet they worked together to rescue Rotta, the son of crime lord Jabba Desilijic Tiure, and returned Rotta to his father, thus facilitating a crucial alliance between the Hutt Clan and the Galactic Republic."
    },
    {
      "id": 6,
      "name": "Qui-Gon Jinn",
      "origin": "Coruscant",
      "role": "Jedi Knight",
      "portrait": "https://i.imgur.com/D67aPIi.jpg",
      "image": "https://i.imgur.com/Bh4MRco.png",
      "description": "Qui-Gon Jinn, a Force-sensitive human male, was a venerable if maverick Jedi Master who lived during the last years of the Republic Era. He was a wise and well-respected member of the Jedi Order, and was offered a seat on the Jedi Council, but chose to reject and follow his own path. Adhering to a philosophy centered around the Living Force, Jinn strove to follow the will of the Force even when his actions conflicted with the wishes of the High Council. After encountering Anakin Skywalker, Jinn brought him to the Jedi Temple on Coruscant, convinced he had found the Chosen One. His dying wish was for Skywalker to become a Jedi and ultimately restore balance to the Force."
    },
    {
      "id": 7,
      "name": "Boba Fett",
      "origin": "Kamino",
      "role": "Bounty Hunter",
      "portrait": "https://i.imgur.com/sZkU5bN.png",
      "image": "https://i.imgur.com/oymtFJG.png",
      "family": [
        {
          "name": "Jango Fett",
          "member": "Father"
        }
      ],
      "description": "Boba Fett was a human male crime lord and former bounty hunter whose career spanned decades, from the fall of the Galactic Republic to the end of the rule of the Galactic Empire. Originally code-named Alpha, he was an unaltered clone of the famed Mandalorian bounty hunter Jango Fett who raised the boy as his son. Boba emulated his father and genetic donor by wearing a customized suit of Mandalorian armor. His personal starship was the Slave I, a Firespray-31-class patrol and attack craft that once belonged to Jango. Trained in combat and martial skills from a young age, Fett was one of the most feared bounty hunters in the galaxy during the reign of Emperor Palpatine. He became a legend over the course of his career, which included contracts for both the Empire and the extensive criminal underworld. After living among the Tusken Raiders of Tatooine for a time, he took over as Daimyo of Mos Espa during the era of the New Republic."
    },
    {
      "id": 8,
      "name": "Lando Calrissian",
      "origin": "Socorro",
      "role": "Entrepreneur",
      "portrait": "https://i.imgur.com/CuBUeaZ.jpg",
      "image": "https://i.imgur.com/dmgHViR.png",
      "family": [
        {
          "name": "Unknown",
          "member": "Daughter"
        }
      ],
      "description": "Landonis Balthazar 'Lando' Calrissian, was a human male smuggler, gambler, entrepreneur, and card player who became Baron Administrator of Cloud City and, later, a general in the Rebel Alliance. Born on Socorro, he was the owner of the Millennium Falcon before losing it to Han Solo in a game of sabacc on Numidian Prime. After losing the Falcon, Calrissian put an end to his days as a smuggler and became an entrepreneur, setting up a small mining operation on the planet Lothal before eventually becoming the leader of Cloud City in the skies of the planet Bespin."
    },
    {
      "id": 9,
      "name": "Rex",
      "origin": "Kamino",
      "role": "Clone Commander",
      "portrait": "https://i.imgur.com/WecoiAb.png",
      "image": "https://i.imgur.com/CxE9S8o.png",
      "description": "Rex, formerly designated CT-7567, was a veteran Clone Captain, Clone Commander, and Advanced Recon Commando who commanded the Grand Army of the Republic's famed 501st Legion of clone troopers during the Clone Wars. Rex later served as a captain and commander within the Alliance to Restore the Republic during the Galactic Civil War. Rex participated in many battles over the course of the Clone Wars. As the captain of the 501st, Rex served as second-in-command to Jedi General Anakin Skywalker, whose bravery and unconventionality in battle he came to share. In addition to being a close friend of Skywalker, he also became friends with Skywalker's apprentice, Ahsoka Tano. He was close with Marshal Commander Cody, with their relationship mirroring that of their respective Jedi Generals, Skywalker and Obi-Wan Kenobi, whom Rex was also well acquainted with. Rex and his companions often worked together during the front-line campaigns against the Confederacy of Independent Systems."
    },
    {
      "id": 10,
      "name": "Padme Amidala",
      "origin": "Naboo",
      "role": "Queen",
      "portrait": "https://i.imgur.com/TzO6Urh.jpg",
      "image": "https://i.imgur.com/lpHoncc.png",
      "family": [
        {
          "name": "Anakin Skywalker",
          "member": "Husband"
        },
        {
          "name": "Luke Skywalker",
          "member": "Son"
        },
        {
          "name": "Leia Organa",
          "member": "Daughter"
        }
      ],
      "description": "Padmé Amidala Naberrie was a human female senator who represented the people of Naboo during the final years of the Galactic Republic. Prior to her career in the Galactic Senate, Amidala was the elected ruler of the Royal House of Naboo. A political idealist, she advocated for the preservation of democracy as well as a peaceful resolution to the Clone Wars. However, her secret marriage to the Jedi Knight Anakin Skywalker would have a lasting effect on the future of the galaxy for decades to come."
    },
    {
      "id": 11,
      "name": "Jabba the Hutt",
      "origin": "Nal Hutta",
      "role": "Gangster",
      "portrait": "https://i.imgur.com/j3KISsl.jpg",
      "image": "https://i.imgur.com/SzyfegL.png",
      "family": [
        {
          "name": "Rotta",
          "member": "Son"
        }
      ],
      "description": "Jabba Desilijic Tiure, more commonly referred to as Jabba the Hutt or simply Jabba, and formally styled as His Excellency Jabba Desilijic Tiure of Nal Hutta, Eminence of Tatooine, was a Hutt gangster and crime lord, as well as a leading member of the Grand Hutt Council and influential leader of the Hutt Clan, who operated and led a criminal empire from his palace on the Outer Rim world of Tatooine. Jabba was a major figure on Tatooine, where he controlled the bulk of the piracy, slavery, and trafficking in illegal goods that generated most of the planet's wealth. He was also highly influential in the entire Outer Rim as one of its most powerful crime lords."
    },
    {
      "id": 12,
      "name": "Kylo Ren",
      "origin": "Chandrila",
      "role": "Supreme Leader",
      "portrait": "https://i.imgur.com/d9NFyUi.jpg",
      "image": "https://i.imgur.com/nrVwMUY.png",
      "family": [
        {
          "name": "Leia Organa",
          "member": "Mother"
        },
        {
          "name": "Han Solo",
          "member": "Father"
        }
      ],
      "description": "Ben Solo was a human male Force-sensitive who fell to the dark side of the Force as Kylo Ren, master of the Knights of Ren and eventual Supreme Leader of the First Order, but returned to the light side shortly before his death. He was born at the end of the Galactic Civil War in 5 ABY, when the Galactic Empire surrendered to the New Republic. His parents, General Han Solo and Princess Leia Organa, were considered great heroes of the Alliance to Restore the Republic, as was his maternal uncle, Jedi Master Luke Skywalker. The heir to the Skywalker bloodline, Ben Solo possessed raw strength in the Force and had the potential for limitless power. His grandfather, Anakin Skywalker, had become the Sith Lord Darth Vader through the machinations of Darth Sidious, the Dark Lord of the Sith. The phantom Sidious similarly targeted Solo and used his creation, Supreme Leader Snoke, to groom Solo from an early age to doubt his family and eventually turn to the dark side."
    },
    {
      "id": 13,
      "name": "Din Djarin",
      "origin": "Aq Vetina",
      "role": "Mandalorian",
      "portrait": "https://i.imgur.com/8aL3vba.jpg",
      "image": "https://i.imgur.com/10eTYS5.png",
      "family": [],
      "description": "Din Djarin, also known as 'the Mandalorian' or simply 'Mando', was a human male Mandalorian warrior during the era of the New Republic. With his Mandalorian armor, IB-94 blaster pistol, Amban sniper rifle, and distinctive beskar helmet, Djarin was both well-equipped and enigmatic—a stranger whose past was shrouded in mystery to others. He hailed from Aq Vetina and became orphaned during the end of the Galactic Republic, and was raised as a foundling by the Children of the Watch, an orthodox cult that had broken off from mainstream Mandalorian society. Djarin was unaware of this and believed that all Mandalorians followed the Children of the Watch's beliefs. He was trained to become a Mandalorian warrior and eventually joined the Tribe, which operated in a secret covert on Nevarro. Djarin became battle-hardened, a man of few words, and a formidable hunter in an increasingly dangerous galaxy."
    },
    {
      "id": 14,
      "name": "Grogu",
      "origin": "Unknown",
      "role": "Padawan",
      "portrait": "https://i.imgur.com/h36dTXR.jpg",
      "image": "https://i.imgur.com/o0yXG3r.png",
      "family": [],
      "description": "Grogu, known to many simply as 'The Child', was a male Force-sensitive Jedi Initiate and Mandalorian foundling who belonged to the same species as Jedi Grand Master Yoda and Jedi Master Yaddle. Grogu was born in the year 41 BBY, and was raised at the Jedi Temple on Coruscant. Grogu was eventually held at a hideout run by Nikto mercenaries on Arvala-7 during the New Republic Era, having survived the siege of the Jedi Temple decades prior. While still an infant at the age of fifty years, he was sought, on behalf of Moff Gideon, by an Imperial who hired Mandalorian bounty hunter Din Djarin to retrieve him."
    },
    {
      "id": 15,
      "name": "Chewbacca",
      "origin": "Kashyyyk",
      "role": "Bounty Hunter",
      "portrait": "https://i.imgur.com/jGFVPFG.jpg",
      "image": "https://i.imgur.com/sl9N9vO.png",
      "family": [],
      "description": "Chewbacca, known affectionately to his friends as Chewie, was a Wookiee male warrior, smuggler, mechanic, pilot, and resistance fighter who fought in the Clone Wars, the Galactic Civil War, and the Cold War and subsequent First Order-Resistance War. He hailed from the planet Kashyyyk and became a Wookiee military leader. During the Clone Wars, he was captured by Trandoshan slavers and held captive on Wasskah, but he worked with a fellow captive, Jedi Commander Ahsoka Tano, to escape. He later commanded Wookiee forces of the Kachirho Wookiee Militia during the Battle of Kashyyyk alongside the Grand Army of the Republic, led by Jedi General Yoda. During the battle, one of the last ones of the war, Yoda's clone troopers received Order 66 from Supreme Chancellor Palpatine and, with the help of Chewbacca and his fellow Wookiee Chieftain and General Tarfful, Yoda escaped Kashyyyk and the destruction of the Jedi Order."
    },
    {
      "id": 16,
      "name": "Darth Sidious",
      "origin": "Naboo",
      "role": "Sith Lord",
      "portrait": "https://i.imgur.com/JVB2Ldk.jpg",
      "image": "https://i.imgur.com/V6LcpI1.png",
      "family": [],
      "description": "Darth Sidious, born Sheev Palpatine and also known simply as the Emperor, was a Force-sensitive human male Dark Lord of the Sith and Emperor of the Galactic Empire, ruling from 19 BBY to 4 ABY. Rising to power in the Galactic Senate as the senator of Naboo, the secretive Sith Lord cultivated two identities, Sidious and Palpatine, using both to further his political career. He orchestrated the fall of the Galactic Republic and the Jedi Order through the Clone Wars, and then established his reign over the galaxy which lasted until his death at the Battle of Endor. However, the dark side of the Force gave rise to powers which allowed the Emperor to return from the grave."
    },
    {
      "id": 17,
      "name": "General Grievous",
      "origin": "Kalee",
      "role": "Confederacy General",
      "portrait": "https://i.imgur.com/hM78m5P.png",
      "image": "https://i.imgur.com/adv0OJL.png",
      "family": [],
      "description": "Grievous, born as Qymaen jai Sheelal, was a Kaleesh male warlord who served within the military forces of the Confederacy of Independent Systems as a commanding officer during the Clone Wars in the final years of the Republic Era. In addition to his position as a general within the Separatist Droid Army, the Kaleesh held the title of Supreme Martial Commander of the Separatist Droid Armies throughout the duration of the war, in which he led countless engagements against the Republic's Grand Army. Recognized for his ruthless tactics and extensive cybernetic enhancements, Grievous utilized the Separatist Droid Army and his adept combat skills to instill fear throughout the galaxy as he traveled to and invaded planets, while also engaging numerous Knights of the Jedi Order, his sworn enemies."
    },
    {
      "id": 18,
      "name": "Mace Windu",
      "origin": "Haruun Kal",
      "role": "Jedi Knight",
      "portrait": "https://i.imgur.com/QkkBa1G.png",
      "image": "https://i.imgur.com/QNzhr2r.png",
      "family": [],
      "description": "Mace Windu was a revered Force-sensitive human male Jedi Master and member of the Jedi High Council during the last years of the Republic Era. During his time in the Jedi Order, he once served as elected leader of the Jedi and, during the Clone Wars, as a Jedi General in the Grand Army of the Republic. He was the greatest champion of the Jedi Order and promoted its ancient traditions amidst the growing influence of the dark side of the Force in the corrupt, declining days of the Republic."
    },
    {
      "id": 19,
      "name": "Plo Koon",
      "origin": "Dorin",
      "role": "Jedi Knight",
      "portrait": "https://i.imgur.com/ovuUlwh.png",
      "image": "https://i.imgur.com/fLNjNKn.png",
      "family": [],
      "description": "Plo Koon was a Force-sensitive Kel Dor Jedi Master who served as a member of the Jedi High Council during the last years of the Galactic Republic. He served as a respected Jedi General during the Clone Wars, a pan-galactic conflict between the Republic and its splinter state, the Confederacy of Independent Systems. During the war he frequently undertook dangerous missions with the soldiers under his command, the 104th Battalion. Koon wore a breath mask to filter the air around him so that it matched his home planet of Dorin, and wore goggles to prevent his eye fluids from evaporating."
    },
    {
      "id": 20,
      "name": "Ki-Adi-Mundi",
      "origin": "Cerea",
      "role": "Jedi Knight",
      "portrait": "https://i.imgur.com/tycxKRx.png",
      "image": "https://i.imgur.com/7rljNlp.png",
      "family": [],
      "description": "Ki-Adi-Mundi was a Force-sensitive Cerean male Jedi Master and member of the Jedi High Council during the last years of the Galactic Republic. By the time of the Clone Wars, Mundi became a Jedi General of the Grand Army of the Republic. Like his Jedi colleagues, he led the Republic clone troopers against the Separatist Alliance forces in several battles across the galaxy, including the first and second campaign on Geonosis and the Outer Rim Sieges. In 19 BBY, the third and final year of the war, Mundi oversaw the Republic invasion of Mygeeto with the 21st Nova Corps under his command. During the campaign, Supreme Chancellor Sheev Palpatine instructed the Grand Army soldiers to execute their Jedi leaders in accordance with Order 66, an act which resulted in the death of Mundi along with the majority of the Jedi Order."
    },
    {
      "id": 21,
      "name": "Yoda",
      "origin": "Unknown",
      "role": "Jedi Knight",
      "portrait": "https://i.imgur.com/8XsOMIk.png",
      "image": "https://i.imgur.com/CjFTVXs.png",
      "family": [],
      "description": "Yoda, a Force-sensitive male being belonging to a mysterious species, was a legendary Jedi Master who witnessed the rise and fall of the Galactic Republic, followed by the rise of the Galactic Empire. Small in stature but revered for his wisdom and power, Yoda trained generations of Jedi, ultimately serving as the Grand Master of the Jedi Order. Having lived through nine centuries of galactic history, he played integral roles in the Clone Wars, the rebirth of the Jedi through Luke Skywalker, and unlocking the path to immortality."
    },
    {
      "id": 22,
      "name": "Darth Vader",
      "origin": "Tatooine",
      "role": "Sith Lord",
      "portrait": "https://i.imgur.com/sMOmWfH.png",
      "image": "https://i.imgur.com/DKJdN51.png",
      "family": [
        {
          "name": "Padme Amidala",
          "member": "Wife"
        },
        {
          "name": "Shmi Skywalker",
          "member": "Mother"
        },
        {
          "name": "Luke Skywalker",
          "member": "Son"
        },
        {
          "name": "Leia Organa",
          "member": "Daughter"
        }
      ],
      "description": "Vader enforced the rule of the New Order as the Emperor's Sith apprentice throughout most of the Imperial Era. In the aftermath of the Battle of Yavin in 0 BBY, he discovered the existence of his son and was determined to turn Luke to the dark side. Luke sought to become a Jedi, like his father before him, and believed that Vader had the potential to turn back to the light side of the Force. Vader was defeated by Luke during the Battle of Endor in 4 ABY, but the young Jedi refused to strike down his father in anger, causing the Emperor to torture Luke with Force lightning. The pain inflicted on his son awakened the part of Vader that was still Anakin, resulting in a redeemed Skywalker killing Sidious at the cost of his own life. Having destroyed the Sith and fulfilled his destiny as the Chosen One, Skywalker made peace with his son and became one with the Force."
    },
    {
      "id": 23,
      "name": "Kanan Jarrus",
      "origin": "Coruscant",
      "role": "Jedi Knight",
      "portrait": "https://i.imgur.com/RkrKGrY.jpg",
      "image": "https://i.imgur.com/jPQIrFO.png",
      "family": [],
      "description": "Kanan Jarrus, born Caleb Dume, was a Force-sensitive human male Jedi Knight who survived Order 66 during the Clone Wars. Living on thanks to the sacrifice of his Master, Depa Billaba, on Kaller, he met the smuggler Janus Kasmir, who taught him how to survive as a fugitive. Going into hiding, he forsook the Jedi ways for some time, swapping his blue-bladed lightsaber for a blaster. After working with the Twi'lek rebel operative Hera Syndulla during the Gorse Conflict, Jarrus decided to join her nascent rebel cell."
    },
    {
      "id": 24,
      "name": "Ezra Bridger",
      "origin": "Lothal",
      "role": "Padawan",
      "portrait": "https://i.imgur.com/4BUpJzf.png",
      "image": "https://i.imgur.com/W9Nv5Yb.png",
      "family": [
        {
          "name": "Mira Bridger",
          "member": "Mother"
        },
        {
          "name": "Ephraim Bridger",
          "member": "Dather"
        }
      ],
      "description": "Ezra Bridger, a Force-sensitive human male, was a Jedi Padawan, a freedom fighter, and a revolutionary leader in the early rebellion against the Galactic Empire. He was born on Empire Day in 19 BBY to Ephraim and Mira Bridger. His parents' public criticism of the Empire led to their imprisonment, leaving Bridger an orphan on the planet Lothal as a child. He joined the rebel crew of the Ghost in 5 BBY and was trained in the ways of the Force by Kanan Jarrus. Bridger's abilities grew quickly, and a message of hope he broadcast in the Lothal sector inspired a number of rebel cells to begin working together to fight the Empire."
    },
    {
      "id": 25,
      "name": "Hera Syndulla",
      "origin": "Ryloth",
      "role": "Pilot",
      "portrait": "https://i.imgur.com/mR1QTk9.png",
      "image": "https://i.imgur.com/2vGQTTz.png",
      "family": [
        {
          "name": "Cham Syndulla",
          "member": "Father"
        }
      ],
      "description": "Hera was born in the years before the Clone Wars, and when they broke out and Ryloth became occupied by the Separatists, her father, Cham Syndulla, led a resistance to liberate their people. During the many battles, Hera was inspired by starships and desired to become a pilot, and was inspired by her father's determination to fight for their people and their world. At some point during the Clone Wars, young Hera acquired the cobbled-together astromech C1-10P. At the conclusion of the Clone Wars, when the Republic was transformed into the tyrannical Galactic Empire, they refused to leave Ryloth and Cham found himself fighting a new enemy. Alas, his rebellion would cost him his wife, Hera's mother, at the hands of the Empire, driving him to want nothing more than the liberation of his world. This drove a wedge between Hera and her father, leading her to leave Ryloth to become a star-pilot, and eventually a member of the Rebellion against the Empire."
    },
    {
      "id": 26,
      "name": "Sabine Wren",
      "origin": "Mandalore",
      "role": "Mandalorian",
      "portrait": "https://i.imgur.com/tTX91SA.png",
      "image": "https://i.imgur.com/lafvBjr.png",
      "family": [],
      "description": "Sabine Wren was a human female Mandalorian warrior and revolutionary leader during the early rebellion against the Galactic Empire. Her artistry during the rebellion inspired the symbol of the Alliance to Restore the Republic, and her claim over the ancient Mandalorian weapon known as the Darksaber made her a symbol to Clan Wren and the hopes of freeing her people's homeworld of Mandalore from the rule of the Empire. Prior to becoming a rebel, Wren was a cadet at the Imperial Academy of Mandalore. She built weapons she believed would be used for peace but were instead used against her family and her people. Wracked with guilt, Wren left Mandalore and was branded a traitor by the Empire and her mother, Ursa Wren, leader of the clan. Wren worked as a bounty hunter alongside her friend Ketsu Onyo before being recruited by Captain Hera Syndulla and the Jedi Kanan Jarrus to join their rebel crew aboard the starship Ghost. Together, the crew fought against the Empire and used Wren's art as a symbol of hope. They became part of a larger rebel movement, with Wren's work continuing to inspire the fledgling rebellion."
    },
    {
      "id": 27,
      "name": "Garazeb Orrelios",
      "origin": "Lasan",
      "role": "Lasan Honor Guard",
      "portrait": "https://i.imgur.com/BlWpo3Z.png",
      "image": "https://i.imgur.com/YSegCgi.png",
      "family": [],
      "description": "Garazeb 'Zeb' Orrelios was born and raised on the planet Lasan and served as Captain of the Lasan High Honor Guard, where it was his duty to protect the royal family and assist his people into rising up against the Galactic Empire in its early days as the first species ever to have done so. When the Empire responded to this rebellion by sacking and massacring the Lasats themselves, Zeb, along with the rest of the Honor Guard, helped protect their people. Unfortunately, they were no match for the Empire's assault on the Royal Palace of Lasat, and were finished when a bomb was set off, destroying most of the castle. Zeb managed to survive the endeavor, unlike most of his kind. But because of its ordeal, he grew a gruff demeanor, but has remained loyal to a great deal of sympathy towards the weak, thus earning him a place in the rebel crew of a VCX-100 light freighter called the Ghost by the time he was thirty-nine."
    }
  ],
  "movies": [
    {
      "id": 4,
      "number": "IV",
      "name": "A New Hope",
      "year": 1977,
      "poster": "https://i.imgur.com/uEb3okZ.jpg",
      "trailer": "306727530",
      "crawl": "It is a period of civil war. Rebel spaceships, striking from a hidden base, have won their first victory against the evil Galactic Empire. During the battle, Rebel spies managed to steal secret plans to the Empire's ultimate weapon, the DEATH STAR, an armored space station with enough power to destroy an entire planet. Pursued by the Empires sinister agents, Princess Leia races home aboard her starship, custodian of the stolen plans that can save her people and restore freedom to the galaxy.",
      "filmMakers": [
        {
          "name": "George Lucas",
          "role": "Director"
        },
        {
          "name": "Gary Kurtz",
          "role": "Producer"
        },
        {
          "name": "Rick McCallum",
          "role": "Producer"
        },
        {
          "name": "John Williams",
          "role": "Score"
        }
      ]
    },
    {
      "id": 5,
      "number": "V",
      "name": "The Empires Strikes Back",
      "year": 1980,
      "poster": "https://i.imgur.com/2Ro0XWd.jpg",
      "trailer": "126050121",  
      "crawl": "It is a dark time for the Rebellion. Although the Death Star has been destroyed, Imperial troops have driven the Rebel forces from their hidden base and pursued them across the galaxy. Evading the dreaded Imperial Starfleet, a group of freedom fighters led by Luke Skywalker has established a new secret base on the remote ice world of Hoth. The evil lord Darth Vader, obsessed with finding young Skywalker, has dispatched thousands of remote probes into the far reaches of space....",
      "filmMakers": [
        {
          "name": "Irvin Kershner",
          "role": "Director"
        },
        {
          "name": "Gary Kurtz",
          "role": "Producer"
        },
        {
          "name": "Rick McCallum",
          "role": "Producer"
        },
        {
          "name": "John Williams",
          "role": "Score"
        }
      ]
    },
    {
      "id": 6,
      "number": "VI",
      "name": "Return of the Jedi",
      "year": 1980,
      "poster": "https://i.imgur.com/oylncpC.jpg",
      "trailer": "182190638",
      "crawl": "Luke Skywalker has returned to his home planet of Tatooine in an attempt to rescue his friend Han Solo from the clutches of the vile gangster Jabba the Hutt.Little does Luke know that the GALACTIC EMPIRE has secretly begun construction on a new armored space station even more powerful than the first dreaded Death Star. When completed, this ultimate weapon will spell certain doom for the small band of rebels struggling to restore freedom to the galaxy....",
      "filmMakers": [
        {
          "name": "Richard Marquand",
          "role": "Director"
        },
        {
          "name": "George Lucas",
          "role": "Producer"
        },
        {
          "name": "Howard G. Kazanjian",
          "role": "Producer"
        },
        {
          "name": "John Williams",
          "role": "Score"
        }
      ]
    },
    {
      "id": 1,
      "number": "I",
      "name": "The Phantom Menace",
      "year": 1999,
      "poster": "https://i.imgur.com/ezhgI1r.jpg",
      "trailer": "313572494",
      "crawl": "Turmoil has engulfed the Galactic Republic. The taxation of trade routes to outlying star systems is in dispute. Hoping to resolve the matter with a blockade of deadly battleships, the greedy Trade Federation has stopped all  shipping to the small planet of Naboo. While the Congress of the Republic endlessly debates this alarming chain of events, the Supreme Chancellor has secretly dispatched two Jedi Knights, the guardians of peace and justice in the galaxy, to settle the conflict….",
      "filmMakers": [
        {
          "name": "George Lucas",
          "role": "Director"
        },
        {
          "name": "Rick McCallum",
          "role": "Producer"
        },
        {
          "name": "John Williams",
          "role": "Score"
        }
      ]
    },
    {
      "id": 2,
      "number": "II",
      "name": "Attack of the Clones",
      "year": 2002,
      "poster": "https://i.imgur.com/kzerptR.jpg",
      "trailer": "40269091",
      "crawl": "There is unrest in the Galactic Senate. Several thousand solar systems have declared their intentions to leave the Republic. This separatist movement, under the leadership of the mysterious Count Dooku, has made it difficult for the limited number of Jedi Knights to maintain peace and order in the galaxy. Senator Amidala, the former Queen of Naboo, is turning to the Galactic Senate to vote on the critical issue of creating an ARMY OF THE REPUBLIC to assist the overwhelmed Jedi....",
      "filmMakers": [
        {
          "name": "George Lucas",
          "role": "Director"
        },
        {
          "name": "Rick McCallum",
          "role": "Producer"
        },
        {
          "name": "John Williams",
          "role": "Score"
        }
      ]
    },
    {
      "id": 3,
      "number": "III",
      "name": "Revenge of the Sith",
      "year": 2005,
      "poster": "https://i.imgur.com/zAPSxtc.jpg",
      "trailer": "216560136",
      "crawl": "War! The Republic is crumbling under attacks by the ruthless Sith Lord, Count Dooku. There are heroes on both sides. Evil is everywhere. In a stunning move, the fiendish droid leader, General Grievous, has swept into the Republic capital and kidnapped Chancellor Palpatine, leader of the Galactic Senate. As the Separatist Droid Army attempts to flee the besieged capital with their valuable hostage, two Jedi Knights lead a desperate mission to rescue the captive Chancellor....",
      "filmMakers": [
        {
          "name": "George Lucas",
          "role": "Director"
        },
        {
          "name": "Rick McCallum",
          "role": "Producer"
        },
        {
          "name": "John Williams",
          "role": "Score"
        }
      ]
    },
    {
      "id": 7,
      "number": "VII",
      "name": "The Force Awakens",
      "year": 2015,
      "poster": "https://i.imgur.com/uhLAqI1.jpg",
      "trailer": "113102368",
      "crawl": "Luke Skywalker has vanished. In his absence, the sinister FIRST ORDER has risen from the ashes of the Empire and will not rest until Skywalker, the last Jedi, has been destroyed. With the support of the REPUBLIC, General Leia Organa leads a brave RESISTANCE. She is desperate to find her brother Luke and gain his help in restoring peace and justice to the galaxy. Leia has sent her most daring pilot on a secret mission to Jakku, where an old ally has discovered a clue to Luke's whereabouts....",
      "filmMakers": [
        {
          "name": "J.J. Abrams",
          "role": "Director"
        },
        {
          "name": "Kathleen Kennedy",
          "role": "Producer"
        },
        {
          "name": "John Williams",
          "role": "Score"
        }
      ]
    },
    {
      "id": 8,
      "number": "VIII",
      "name": "The Last Jedi",
      "year": 2017,
      "poster": "https://i.imgur.com/cHButly.jpg",
      "trailer": "237893785",
      "crawl": "The FIRST ORDER reigns. Having decimated the peaceful Republic, Supreme Leader Snoke now deploys his merciless legions to seize military control of the galaxy. Only General Leia Organa's band of RESISTANCE fighters stand against the rising tyranny, certain that Jedi Master Luke Skywalker will return and restore a spark of hope to the fight. But the Resistance has been exposed. As the First Order speeds toward the Rebel base, the brave heroes mount a desperate escape....",
      "filmMakers": [
        {
          "name": "Rian Johnson",
          "role": "Director"
        },
        {
          "name": "Kathleen Kennedy",
          "role": "Producer"
        },
        {
          "name": "John Williams",
          "role": "Score"
        }
      ]
    },
    {
      "id": 9,
      "number": "IX",
      "name": "The Rise of Skywalker",
      "year": 2019,
      "poster": "https://i.imgur.com/o08jYAv.jpg",
      "trailer": "346078576",
      "crawl": "The dead speak! The galaxy has heard a mysterious broadcast, a threat of REVENGE in the sinister voice of the late EMPEROR PALPATINE. GENERAL LEIA ORGANA dispatches secret agents to gather intelligence, while REY, the last hope of the Jedi, trains for battle against the diabolical FIRST ORDER. Meanwhile, Supreme Leader KYLO REN rages in search of the phantom Emperor, determined to destroy any threat to his power....",
      "filmMakers": [
        {
          "name": "Rian Johnson",
          "role": "Director"
        },
        {
          "name": "Kathleen Kennedy",
          "role": "Producer"
        },
        {
          "name": "John Williams",
          "role": "Score"
        }
      ]
    },
    {
      "id": 10,
      "name": "Rogue One: A Star Wars Story",
      "year": 2016,
      "poster": "https://i.imgur.com/pBfaLVh.jpg",
      "trailer": "178948010",
      "filmMakers": [
        {
          "name": "Gareth Edwards",
          "role": "Director"
        },
        {
          "name": "Kathleen Kennedy",
          "role": "Producer"
        },
        {
          "name": "Michael Giacchino",
          "role": "Score"
        }
      ]
    },
    {
      "id": 11,
      "name": "Solo: A Star Wars Story",
      "year": 2018,
      "poster": "https://i.imgur.com/b60OuCJ.jpg",
      "trailer": "264330321",
      "filmMakers": [
        {
          "name": "Ron Howard",
          "role": "Director"
        },
        {
          "name": "Kathleen Kennedy",
          "role": "Producer"
        },
        {
          "name": "John Powell",
          "role": "Score"
        }
      ]
    }
  ],
  "planets": [
    {
      "id": 1,
      "name": "Coruscant",
      "image": "https://i.imgur.com/y1Ul7SP.jpg",
      "suns": 1,
      "region": "Core",
      "size": 12240,
      "coordinates": "0, 0, 0"
    },
    {
      "id": 2,
      "name": "Tatooine",
      "image": "https://i.imgur.com/Mf7YdLO.jpg",
      "suns": 2,
      "region": "Outer Rim",
      "size": 10465
    }
  ]
}
